{
  "batch_number": 1,
  "total_batches": 1,
  "segment_count": 70,
  "segments": [
    {
      "id": "7e436557-adf4-4b58-9239-e94e14dc136d",
      "source": "Sheet 1"
    },
    {
      "id": "76fcff44-7a25-4a36-9f21-641fcef9b265",
      "source": "Coffee with a Little Sugar"
    },
    {
      "id": "1a3e064c-239f-4e4d-b09a-e17659c4328e",
      "source": "Female Audience"
    },
    {
      "id": "7cdb9a9d-507b-4262-9af4-22f23197d05f",
      "source": "The enigmatic Li Yuanshuo, seeking revenge for his son who lies in a coma, pays a fortune to hire an international bounty hunter—Li Mingzhe—to torment Ning Jia, the woman he believes harmed his son. Unaware that his son’s feelings were one-sided, the long-bitter Li Yuanshuo launches his retaliation—determined to make Ning Jia taste the heartbreak of being abandoned by the one she loves.\nThe truth is that Li Yuanshuo’s son pursued Ning Jia obsessively, and she turned him down gently. Junyan, afraid he would keep harassing her, lied that Ning Jia was already engaged. Crushed by Junyan’s words, he was hit by a car while crossing the street and has remained unconscious in the hospital. Though Ning Jia didn’t injure him, Li Yuanshuo believes that without her, his son would never have met with the accident.\nA man born with resources and a keen grasp of human nature naturally treats every woman as prey, drawing close under the pull of his objectives—but the finest hunters often appear as the prey... In the end, who wins?"
    },
    {
      "id": "6f315924-09cb-42b7-a320-6fc313e04c14",
      "source": "The Humble Young Scholar"
    },
    {
      "id": "05691a3a-4d2e-41c1-8dde-dc95d052747f",
      "source": "Male Audience"
    },
    {
      "id": "cb2faeea-9748-4959-9d8c-8b15544769ad",
      "source": "After being dumped by a gold-digging girlfriend, engineering guy Wang Yu gets into a car crash and wakes up having traveled to the Great Kang Dynasty—lying in a thatched hut. Great Kang is short of people; to boost the population, the village chief gathers unmarried men to choose wives. Wang Yu falls for Li Xiruo at first sight and they become husband and wife. But the previous owner of this body was a spendthrift, leaving Wang Yu penniless. Just as the local bully Liu Youcai comes to collect debts, Wang Yu relies on modern know-how and hard-won experience to build wealth step by step. He leads the villagers in wits and battles against Liu Youcai and his wastrel son Liu Jianye, inventing a series of novel products and policies—and changing Great Kang’s fate."
    },
    {
      "id": "f423bde7-7dfd-4122-b815-6e190bf5e6b8",
      "source": "The CEO’s Sudden Windfall"
    },
    {
      "id": "a32f4859-66c5-4ed8-bd72-c28156a5d2cd",
      "source": "Male Audience"
    },
    {
      "id": "1abe3708-7785-40ca-935b-c3a95fe23836",
      "source": "At the engagement banquet between the Ling and Shangguan families, Ling Xiao is attacked by an assassin and collapses in a pool of blood. In a flash of light, he travels back five years—to a charity gala—only to discover he’s landed in a parallel world where this Ling Xiao is a notorious good-for-nothing. The illegitimate son Ling Yun currently controls the Ling Group’s projects. While Ling Yun is discussing a cultural-tourism project with its head, Tang De, Ling Xiao steps in, halts the project, and predicts it will have to relocate. The moment he returns to the company, he begins cleaning up its culture and kicking out the arrogant nepotistic insiders. This time, he will rebuild his legacy."
    },
    {
      "id": "49873e31-cb4c-42cc-a79c-4c07d175fe00",
      "source": "A Daytime Affair: The CEO Is Wild and Irresistible"
    },
    {
      "id": "5d2b2d3c-723a-49c7-9d43-b8180c07f761",
      "source": "Female Audience"
    },
    {
      "id": "3e1f6a37-52ad-4ec4-b94c-cd1b8b0edf9e",
      "source": "Xia Jinwei, infatuated with Ji Sichen, agrees to donate a kidney to his “white moonlight” Gu Yaoyao on the condition that Ji Sichen marries her. She believes marriage will bind them together, but what follows is a string of pain—her father’s death, the forced donation, and more. Just as she tries to pull herself out of misery, Ji Sichen’s feelings for her begin to change."
    },
    {
      "id": "1b3975a7-700b-4205-a087-7239e4f94b92",
      "source": "Transmigrated to Ancient Times to Steal the Crown Prince"
    },
    {
      "id": "a3d0d16c-bba9-49f4-9e32-130900c7a5eb",
      "source": "Male Audience"
    },
    {
      "id": "4e9fa756-aac3-4d35-b230-96fded342623",
      "source": "Security guard Zhang Biao transmigrates into an incompetent crown prince in ancient times. Catching a concubine and a servant in an affair, he acts decisively and uses the electric baton he brought through time to deal with the servant. As he moves to punish the concubine, the empress shows up with thugs, trying to strike first and pin a trumped-up crime on him. Zhang Biao refuses to back down and beats them all with the baton. When that fails, the empress joins forces with Grand Pillar of State Qi Tai to drug the emperor and abolish Zhang Biao. At the critical moment, the emperor awakens, dismisses the crowd, and questions Zhang Biao on how to govern—testing him. Zhang Biao’s shocking answers win him control of the court. He moves fast: confiscates the four major grain merchants, relieves disaster victims, and formally takes on Qi Tai."
    },
    {
      "id": "4ea8cb8e-d0c4-4504-aad3-c75d79b92eae",
      "source": "Reborn Legitimate Daughter: The Powerful Minister’s Precious Darling"
    },
    {
      "id": "fc11e714-75f2-4ece-a553-ee3d00c60c1b",
      "source": "Female Audience"
    },
    {
      "id": "079fe123-4055-4b7b-9b57-c3db8a1d34f9",
      "source": "In her previous life, Liu Ruxiang married into the general’s mansion at nineteen and received news of her husband’s death on their wedding night. She struggled alone to keep the whole clan afloat, enduring endless humiliation from her mother-in-law—only to learn her husband had faked his death. Reborn, she finally chooses to live for herself, and in the end, she and Yan Mu find their way to each other."
    },
    {
      "id": "0967c260-6a16-412e-a03f-8fc819dafd11",
      "source": "Ultimate Showdown: Crush the Dragon King"
    },
    {
      "id": "e4e273ff-8854-46a2-a694-0ea9a1af26af",
      "source": "Male Audience"
    },
    {
      "id": "7ac331fe-022e-420c-83f4-ebf448993e0e",
      "source": "Second-generation heir Gu Shaoting is tricked by his ex-wife and the “Dragon King” into losing his fortune and dying. Reborn, he sets out to hunt the Dragon King down. Teaming up with the Phoenix King and the Qilin King, he topples the Dragon King’s one-man rule—though at tremendous cost. Along the way, he also finds love."
    },
    {
      "id": "dd93e89e-1e05-43d7-9849-ec0ab6bf9ded",
      "source": "The Top-Star Young Madam Is Beautiful and Badass"
    },
    {
      "id": "538a48d7-17f4-423d-8706-70c928a4e101",
      "source": "Female Audience"
    },
    {
      "id": "86b73d08-1a53-4c99-82a1-935ad4f9db2e",
      "source": "After a mysterious man takes her innocence, she’s driven out by her father. Five years later, she returns in silence—with her son."
    },
    {
      "id": "b36ad394-6177-4200-824b-70d27b629b4d",
      "source": "The War God of the Underworld: Battle Emperor Awakening"
    },
    {
      "id": "34ca6f9e-25f5-4d2d-8815-9c461b77e07a",
      "source": "Male Audience"
    },
    {
      "id": "9f579c6b-724a-45ea-b067-d1550e79a9d2",
      "source": "After the Battle Emperor Leng Wudao is released from prison, he meets the heiress Shen Qing and helps her overcome one obstacle after another on the road ahead. In the end, they find their way to each other."
    },
    {
      "id": "bb867608-59ed-4c9f-a1f6-3132f53944e5",
      "source": "Flirt and Run: Miss Ning Won’t Take Responsibility"
    },
    {
      "id": "51090eb9-776d-48bf-ae9e-b003702eecb0",
      "source": "Female Audience"
    },
    {
      "id": "fe8d3944-a5e3-4ebe-8cff-cd6e1e298b75",
      "source": "Three years ago, Ning Xi broke up with Pei Qinghan and had an abortion. The once-beloved “goddess of arts and letters” fell from grace overnight, branded as materialistic, worldly, vicious, and more. Three years later, they meet again: Pei Qinghan is the powerful tycoon acquiring her company, while she’s just a small-time salesperson hustling to make ends meet. A transfer order sends her to the group headquarters, where her direct supervisor is also the big boss’s “rumored girlfriend.” She has to fight with all she’s got to survive in the cracks. But as Pei Qinghan closes in step by step, the secret she’s hidden for so long finally can’t be contained. Pei Qinghan never imagined that the child who was “aborted” would return from the dead—clinging to him and calling him Dad."
    },
    {
      "id": "2e38a084-bd22-4a97-b8e6-309a4c0c8caf",
      "source": "Love and Vengeance in That Lifetime"
    },
    {
      "id": "6464a616-28d3-4c60-9226-b4aa12a926c3",
      "source": "Female Audience"
    },
    {
      "id": "64079ceb-c0c6-482c-b5ce-e6cd902edbfd",
      "source": "Gu Qianqian suddenly discovers that the best friend she trusted and the husband she loved have both been deceiving her for money. After an accidental death, she learns that her sworn enemy has been secretly in love with her all along. Watch her turn the tables against all odds—and end up with both love and success."
    },
    {
      "id": "f6ce14cd-c4ed-4105-8144-82dbe483384c",
      "source": "In Your World, I Call the Shots"
    },
    {
      "id": "ec52e8e8-0e16-4c0c-9544-255141bfe036",
      "source": "Female Audience"
    },
    {
      "id": "78657ab3-bd2f-488c-adf7-eab7394c1864",
      "source": "Sun Wei has always felt there’s a bug in the world she lives in—and she’s right. She’s living inside a comic, and the “bugs” she noticed are the result of the author changing the original settings. After Sun Wei awakens self-awareness, she finds the door to the world and crosses into reality, where she meets her creator, the comic artist Li Yang—beginning a breathtaking journey unlike any other."
    },
    {
      "id": "75e976bb-c64b-4d27-87ee-f7a8842b3216",
      "source": "Rise to Riches"
    },
    {
      "id": "db395aea-b33a-4d06-9e8e-a69c2aa0a916",
      "source": "Male Audience"
    },
    {
      "id": "1911da3e-f6a5-45ec-b350-fb20b7a3e094",
      "source": "Changlee Group CEO Li Changlin is poisoned to death by vice president Ma Tiancheng and awakens in the body of a rural young man, Li Xiaolin—about to become the son-in-law of the village bully Tao Hai. Just as the wedding is about to reach the final step, his childhood sweetheart Li Mingyue bursts in and stops the farce of marrying-in. Meanwhile, Li Changlin learns from the news that Ma Tiancheng has become chairman of the Changlee Group. Given a second life, Li Changlin swears revenge."
    },
    {
      "id": "1940625f-4ac6-4a75-9c53-f146350f3974",
      "source": "Delivering Takeout in Ancient Times"
    },
    {
      "id": "b5b8f9e0-a9b9-4391-a502-8b24d87b9ff6",
      "source": "Male Audience"
    },
    {
      "id": "090cfbb0-eedc-4163-8e01-b0364e2a4318",
      "source": "Delivery rider Xiao Shuai transmigrates to the legendary Kingdom of Women. The kingdom’s general, Yue Se—having never seen a man—curiously “studies” his body and eventually turns him over to the queen. Drawing on the old legend of Tang Sanzang, the queen decides men are a harbinger of disaster and orders Xiao Shuai executed. Thanks to Chancellor Hua Rong’s reasoned defense, he survives. From then on, Xiao Shuai disguises himself as a woman to live in the Kingdom of Women, stumbling into a series of hilarious misadventures."
    },
    {
      "id": "5affd009-c250-4bcd-82ca-7973587ffa7e",
      "source": "I’m Determined to Marry You"
    },
    {
      "id": "554dfef9-85c0-4815-ba1d-eaa0c1f46ba3",
      "source": "Female Audience"
    },
    {
      "id": "bded6b71-dad4-46f9-bf12-d4d4cc560876",
      "source": "Shen Jing, the senior disciple of the Yuqing Sect, has never been able to cultivate and is about to marry into the Yuxu Sect as the princess’s live-in son-in-law. At that moment, Xiao Linkun, the young lord of the Mingyue Palace, comes to smash the place. Shen Jing is struck by a mysterious orb of light, awakens a divine technique, and saves his junior sister Qingwu. The two travel together to the Yuxu Sect to propose, only to run into slaughter by an evil cult on the way—dragging them into a larger conspiracy."
    },
    {
      "id": "9498418b-e181-45a8-a654-5de7002cebff",
      "source": "My Wife Became a Big Shot"
    },
    {
      "id": "b8f82f40-c311-4d75-962a-2b852ca5adc3",
      "source": "Male Audience"
    },
    {
      "id": "41c4feec-86f0-4db3-8f75-2a88888f4168",
      "source": "Six years ago, Li Wei and Xiao Chenfeng were a loving couple—until Chenfeng’s old friend Anran returned from abroad. Putting on a facade of kindness, Anran befriended Li Wei while secretly plotting to replace her. Soon Li Wei became pregnant, but Chenfeng was told by a doctor that the child wasn’t biologically his. Li Wei was banished to the “cold palace,” and Chenfeng and Anran grew closer. Six years later, Li Wei’s son Xiao Rui is critically ill with leukemia, and only Chenfeng’s bone marrow can save him. To curry favor, Li Wei has no choice but to bow her head to Anran. Yet as they interact, she gradually closes in on the truth behind the so-called paternity “betrayal” that branded him a cuckold."
    },
    {
      "id": "e13e7d13-010a-486d-9fe4-51d90d3d7fa0",
      "source": "The Wife Strikes Back"
    },
    {
      "id": "0aba8ec1-7c35-48ba-91f6-4d729a2043dc",
      "source": "Female Audience"
    },
    {
      "id": "bcec6121-01fa-4958-8b8f-1e2ddc731d5b",
      "source": "Jiang Wan, the eldest daughter of the Jiang family, bore a daughter, Fu Xingzhou, for Fu Group CEO Fu Siyan—only to have the baby stolen at birth by her younger sister, Jiang Man, an adopted daughter of the Jiang family, and raised as Jiang Man’s child. To treat Fu Xingzhou’s leukemia, Fu Siyan forces Jiang Wan to conceive a second child. Fearing that Jiang Wan will give birth to a healthy baby and become impossible to drive away, Jiang Man schemes to cause a miscarriage. When Jiang Wan learns that one child is gravely ill and the other died before birth, her desire for revenge becomes unstoppable."
    },
    {
      "id": "9ef099c0-59fa-4248-9445-52cd54755cca",
      "source": "A Love That Topples Kingdoms"
    },
    {
      "id": "0c029ffb-8ec9-4858-bf7b-9b0b7b4b830a",
      "source": "Female Audience"
    },
    {
      "id": "d8fce074-74d8-4e13-a126-72b27da0ee1c",
      "source": "To seize the position of queen, Su Moli steals the love token between her younger sister Su Nianyu and the crown prince. Joining forces with a treacherous minister, she frames and kills Su Nianyu, forcing her to drink poisoned wine. At the instant Su Nianyu dies, thunder and lightning split the sky—and everything rewinds to the year she was eighteen. Su Moli still tries to torment her at every turn, but this time the crown prince steps in and saves Su Nianyu. Now, Su Nianyu will take back everything that belongs to her."
    },
    {
      "id": "591299cc-fc14-45d2-bea7-2d2422440eb2",
      "source": "The Young Master’s Secretly Married “Sinner” Wife"
    },
    {
      "id": "33447081-b300-4fac-adfd-26eebd86afdb",
      "source": "Female Audience"
    },
    {
      "id": "26363477-0348-4ebb-8dca-bb14ad8b64cd",
      "source": "A year ago, at the wedding of pregnant Yunhai Group chairwoman Chu Yunxi and Gu Group’s young master Gu Hanlin, Gu Hanlin’s younger brother Gu Hanxi produced a medical report claiming Gu Hanlin was infertile and accused Chu Yunxi of carrying someone else’s child. Chu Yunxi’s cousin Liang Fengyue fanned the flames with compromising photos. Enraged, Gu Hanlin forced Chu Yunxi to miscarry; the shock left her in a vegetative state. Only her private doctor, Xu Zhouzhou, continued to care for her—until a year later, Chu Yunxi finally woke from her coma and vowed revenge on those who framed her."
    },
    {
      "id": "603c484e-4d9c-4f14-bbd3-ea35e60d233a",
      "source": "The God King’s Comeback"
    },
    {
      "id": "690639fe-97bc-420e-a41f-3352e31cd9f1",
      "source": "Male Audience"
    },
    {
      "id": "3871d17e-1899-455e-89a3-c978a672ed1a",
      "source": "Feng Lan is kidnapped by underworld boss Chen Shuting and forced into the sex trade. Qin Feng sees her plight and comes to rescue her. The divine lord Xiao Qiancheng takes a liking to Qin Feng and shelters both of them. But soon Qin Feng is betrayed by his organization; he barely escapes, collapses from severe injuries, and is saved by Su Wanqing. To keep her from being implicated, he chooses to leave. Five years later, he returns with power in hand to marry Su Wanqing—only to find her being bullied by her family. This time, he won’t hold back."
    },
    {
      "id": "9975cbd2-0f24-4118-81af-f8cf2b36f21e",
      "source": "Mr. Sheng: Your Wife Is Back for Revenge"
    },
    {
      "id": "0692aa0b-452d-4a55-a274-7db70f333005",
      "source": "Female Audience"
    },
    {
      "id": "92670afd-e451-402d-877e-6b39993e6481",
      "source": "Ning Qianqian was once a woman surrounded by love, her life full of happiness and hope. But the moment she fell for Sheng Jinglan, everything beautiful shattered. In that relationship, she was forced to miscarry and lost her unborn child, and her family was ruined—blows that plunged her into darkness. In despair, Ning Qianqian chose the most extreme way out: she walked into the flames, faking her death to escape a world of pain. Her body turned to ashes, but her will did not. On the edge of death, Ning Qianqian found her strength again. She swears to return—and to demand justice for herself and the child she never got to meet."
    },
    {
      "id": "05c17b45-20bb-4e9a-b7e3-8fc09b901907",
      "source": "The Strongest Top Scholar in History"
    },
    {
      "id": "3665629d-2e5c-4689-baef-2ce940fb0122",
      "source": "Male Audience"
    },
    {
      "id": "a73bf844-6c95-4e59-9408-fa8c26b898b4",
      "source": "While making out with his girlfriend in a hotel, the male lead is struck by lightning and becomes Wei Chen in the imperial hall of an ancient dynasty. Wei Chen is the son of the Wei household’s master—conceived in a drunken encounter with the maid Xu Qing—and he suffers endless humiliation, yet goes on to place first in the imperial exams. To secure the top scholar title for her nephew, the empress frames Wei Chen for plagiarism and orders him beheaded."
    },
    {
      "id": "82dedda3-3119-4c51-957d-853697162fc7",
      "source": "Agent Phoenix"
    },
    {
      "id": "17c3d524-04bb-4aa7-b897-2f755fce54c3",
      "source": "Female Audience"
    },
    {
      "id": "4a335abc-e480-4bce-89db-17fd1f994ba6",
      "source": "Three years ago, lured by an online bestie, Zhai Ling took her biological younger sister Zhai Manyun to the “paradise” of scammers—the Northern Triangle. The two sisters were captured by the local fraud syndicate leader, Wild Wolf. Only after arriving at the compound did they realize they weren’t the only victims: even their missing parents were imprisoned there. Wild Wolf threatened the sisters with their parents’ lives to force obedience, then went back on his word and had their parents killed. The Zhai sisters were then sold to the territory of Shen Tiannian, a local kingpin of the Northern Triangle—where Zhai Ling met the benefactor who would change her life."
    }
  ]
}